artillery/auth-script.yml
# Load test to test the purchase flow
# For this test we have one phase.
# Phase 1 - In this phase we get a new customer to purchase an item per second during a minute.
# This ends up in around xxx requests made 1 minutes

config:
  target: '<URL>'
  phases:
    - name: sustained load
      duration: 60
      arrivalRate: 1
  payload:
    path: 'info.csv'
    fields:
      - 'email'
      - 'token'
scenarios:
  - name: 'Test purchase flow'
    flow:
      - get:
          url: '/api/product/products_by_id?id=01GVQW8M0RT2KPJB39NP9M1N39&type=single'
      - think: 10
      - get:
          url: '/api/store/addToCart?productId=01GVQW8M0RT2KPJB39NP9M1N39&productTitle=Say%20cloud%20again%20sticker&productImage=uploads/1653053157179_sticker-cloud-again.webp&price=5'
          headers:
            Authorization: 'Bearer {{token}}'
      - think: 10
      - post:
          url: '/api/product/getProducts/'
      - think: 10
      - get:
          url: '/api/product/products_by_id?id=01GVQW8MMFPYEY5J6JJ4JP03SM&type=single'
      - think: 10
      - get:
          url: '/api/store/addToCart?productId=01GVQW8MMFPYEY5J6JJ4JP03SM&productTitle=There%20is%20no%20cloud%20sticker&productImage=uploads/1653053179857_sticker-cloud.webp&price=10'
          headers:
            Authorization: 'Bearer {{token}}'
      - think: 10
      - post:
          url: '/api/store/successBuy'
          headers:
            Authorization: 'Bearer {{token}}'
      - think: 10
      - get:
          url: '/api/store/getHistory'
          headers:
            Authorization: 'Bearer {{token}}'